; domain
(define (domain assignment-environment)
    (:requirements :typing :equality :negative-preconditions :disjunctive-preconditions)
    (:types
        place - object
        loc warehouse - place
        person - object
        crate - object
        food medicine - crate
        robot - object
        carrier - object
        quantity - object
    )

    (:constants agent - robot
                n0 - quantity
                depot - warehouse)
    
    (:predicates
        ; localization predicates
        (robot_at ?r - robot ?pl - place)
        (person_at ?p - person ?pl - place)
        (crate_at ?k - crate ?pl - place)
        (carrier_at ?c - carrier ?pl - place) ; NOTE: assuming the carrier always moves alongside the agent, in this simple problem is redundant!
        
        ; action-based predicates
        (has_crate ?p - person ?k - crate) ; person p has crate c
        (carrying ?c - carrier ?k - crate) ; crate ?k is contained in carrier ?c

        ; mathematical predicates in order to avoid numeric fluents
        (inc ?n ?another_number - quantity) ; should be true if n+1 = another_number
        (dec ?n ?another_number - quantity) ; should be true if n-1 = another_number
        (crates_amount ?c - carrier ?q - quantity) ; should be true if the carrier is holding 'quantity' crates
    )

    ; move the robot ?r from location ?src back to a warehouse in order to load new crates
    (:action back_to_warehouse
        :parameters (?r - robot ?c - carrier ?src - loc ?dst - warehouse)
        :precondition (and
            ; actual action constraints
            (robot_at ?r ?src) (carrier_at ?c ?src)
            ; ensure the robot is not coming back to the depot if any crate is still in the carrier
            (crates_amount ?c n0)
        )
        :effect (and 
            (not (robot_at ?r ?src)) (not (carrier_at ?c ?src)) ; robot and carrier are not at the source location anymore
            (robot_at ?r ?dst) (carrier_at ?c ?dst) ; robot and carrier are at the deposit after moving
        )
    )

    ; move the robot ?r from any place ?src to location ?dst
    (:action move_for_delivery
        :parameters (?r - robot ?c - carrier ?src - place ?dst - loc)
        :precondition (and
            ; actual action constraints
            (robot_at ?r ?src) (carrier_at ?c ?src) (not (= ?src ?dst))
            (not (crates_amount ?c n0))
        )
        :effect (and 
            (not (robot_at ?r ?src)) (not (carrier_at ?c ?src)) ; robot and carrier are not at the source place anymore
            (robot_at ?r ?dst) (carrier_at ?c ?dst); robot and carrier are at the destination location after moving
        )
    )

    ; load the ?end_q crate ?k onto carrier ?c which already has ?start_q crates with robot ?r at warehouse ?wh 
    ; beware that crates can only be loaded at warehouses, not at any place
    (:action load 
        :parameters (?r - robot ?c - carrier ?k - crate ?wh - warehouse ?start_q ?end_q - quantity)
        :precondition (and 
            (robot_at ?r ?wh) (crate_at ?k ?wh) (carrier_at ?c ?wh) ; location constraints
            (not (carrying ?c ?k)) ; ensure the carrier can load the crate
            (inc ?start_q ?end_q) ; ensure this is satisfying the mathematical constraint src_q+1=dst_q
            (crates_amount ?c ?start_q) ; ensure the crate has exactly ?start_q crates before performing this action
        )
        :effect (and 
            (carrying ?c ?k) ; the carrier is actually holding the crate
            (not (crate_at ?k ?wh))
            (crates_amount ?c ?end_q) ; now we have end_q crates rather than start_q crates inside the carrier
            (not (crates_amount ?c ?start_q))
        )
    )

    ; deliver the content of crate ?k to person ?p from robot ?r when at the same location ?l
    ; beware that crates can only be unloaded at locations, since no injured people can be at warehouses
    (:action unload
        :parameters (?r - robot ?c - carrier ?k - crate ?p - person ?l - loc ?start_q ?end_q - quantity)
        :precondition (and 
            (robot_at ?r ?l) (person_at ?p ?l) (carrier_at ?c ?l) ; location constraints
            (carrying ?c ?k) ; make sure we are not trying to unload a crate we don't have!
            (dec ?start_q ?end_q)
            (crates_amount ?c ?start_q)
        )
        :effect (and 
            (not (carrying ?c ?k)) ; the robot is not carrying the crate anymore, so it is free
            (has_crate ?p ?k) ; the crate has been delivered to the person
            (not (crates_amount ?c ?start_q))
            (crates_amount ?c ?end_q)
        )
    )
)

; problem
(define (problem problem_two) (:domain assignment-environment)
(:objects 
    ; let's suppose 10 random locations directly connected to each other
    l0 l1 l2 l3 l4 l5 l6 l7 l8 l9 - loc
    alice wamiq zihadul matteo federico - person
    ; let's suppose 6 crates, 3 containing food and 3 containing medicine (subtypes of crate!)
    f0 f1 f2 - food
    m3 m4 m5 - medicine 
    ; unique carrier object
    carr - carrier
    ; define quantities between 1 to 4
    n1 n2 n3 n4 - quantity
)

(:init
    ; let's suppose all People are in different locations
    (person_at wamiq l0)
    (person_at zihadul l5)
    (person_at alice l8)
    (person_at matteo l3)
    (person_at federico l7)
    
    ; every crate as well as the agent and the carrier are in the 'depot'
    (crate_at f0 depot) (crate_at f1 depot) (crate_at f2 depot) (crate_at m3 depot) (crate_at m4 depot) (crate_at m5 depot)
    (robot_at agent depot) (carrier_at carr depot)
    
    ; in closed-world assumptions, we must mark the carrier as free in the beginning (free = with 0 crates). Otherwise, it cannot pick crates!
    (crates_amount carr n0)

    ; then, let's define increment - decrement relationships among 'quantity' objects
    (inc n0 n1) (inc n1 n2) (inc n2 n3) (inc n3 n4)
    (dec n4 n3) (dec n3 n2) (dec n2 n1) (dec n1 n0)
)

(:goal (and
    ; >>> random definition of what people need >>>

    ; wamiq only needs food
    (or (has_crate wamiq f0) (has_crate wamiq f1) (has_crate wamiq f2))

    ; alternative definition with :existential-preconditions
    ; (exists (?c - food) (and (has_crate wamiq ?c)))

    ; zihadul only needs medicine
    (or (has_crate zihadul m3) (has_crate zihadul m4) (has_crate zihadul m5))

    ; alternative definition with :existential-preconditions
    ; (exists (?c - medicine) (and (has_crate zihadul ?c)))
    
    ; matteo doesn't need anything, so he mustn't be given any crate
    (not (or (has_crate matteo f0) (has_crate matteo f1) (has_crate matteo f2)))
    (not (or (has_crate matteo m3) (has_crate matteo m4) (has_crate matteo m5)))
    
    ; alternative definition with :existential-preconditions
    ; (not (exists (?c - food) (and (has_crate matteo ?c))))
    ; (not (exists (?c - medicine) (and (has_crate matteo ?c))))

    ; alice needs both food and medicine
    (or (has_crate alice m3) (has_crate alice m4) (has_crate alice m5))
    (or (has_crate alice f0) (has_crate alice f1) (has_crate alice f2))

    ; alternative definition with :existential-preconditions
    ; (exists (?c - medicine) (and (has_crate alice ?c)))
    ; (exists (?c - food) (and (has_crate alice ?c)))

    ; federico needs both food and medicine
    (or (has_crate federico m3) (has_crate federico m4) (has_crate federico m5))
    (or (has_crate federico f0) (has_crate federico f1) (has_crate federico f2))

    ; alternative definition with :existential-preconditions
    ; (exists (?c - medicine) (and (has_crate federico ?c)))
    ; (exists (?c - food) (and (has_crate federico ?c)))

    ; <<< random definition of what people need <<<

)
)
)

; plan
1. (load agent carr f0 depot n0 n1)
   deleted: (crate_at f0 depot) (crates_amount carr n0)
   added: (carrying carr f0) (crates_amount carr n1)
   goals met: 2 of 8
2. (load agent carr f1 depot n1 n2)
   deleted: (crate_at f1 depot) (crates_amount carr n1)
   added: (carrying carr f1) (crates_amount carr n2)
   goals met: 2 of 8
3. (load agent carr f2 depot n2 n3)
   deleted: (crate_at f2 depot) (crates_amount carr n2)
   added: (carrying carr f2) (crates_amount carr n3)
   goals met: 2 of 8
4. (load agent carr m3 depot n3 n4)
   deleted: (crate_at m3 depot) (crates_amount carr n3)
   added: (carrying carr m3) (crates_amount carr n4)
   goals met: 2 of 8
5. (move_for_delivery agent carr depot l0)
   deleted: (robot_at agent depot) (carrier_at carr depot)
   added: (robot_at agent l0) (carrier_at carr l0)
   goals met: 2 of 8
6. (unload agent carr f2 wamiq l0 n4 n3)
   deleted: (carrying carr f2) (crates_amount carr n4)
   added: (has_crate wamiq f2) (crates_amount carr n3)
   goals met: 3 of 8
7. (move_for_delivery agent carr l0 l5)
   deleted: (robot_at agent l0) (carrier_at carr l0)
   added: (robot_at agent l5) (carrier_at carr l5)
   goals met: 3 of 8
8. (unload agent carr m3 zihadul l5 n3 n2)
   deleted: (carrying carr m3) (crates_amount carr n3)
   added: (has_crate zihadul m3) (crates_amount carr n2)
   goals met: 4 of 8
9. (move_for_delivery agent carr l5 l7)
   deleted: (robot_at agent l5) (carrier_at carr l5)
   added: (robot_at agent l7) (carrier_at carr l7)
   goals met: 4 of 8
10. (unload agent carr f1 federico l7 n2 n1)
   deleted: (carrying carr f1) (crates_amount carr n2)
   added: (has_crate federico f1) (crates_amount carr n1)
   goals met: 5 of 8
11. (move_for_delivery agent carr l7 l8)
   deleted: (robot_at agent l7) (carrier_at carr l7)
   added: (robot_at agent l8) (carrier_at carr l8)
   goals met: 5 of 8
12. (unload agent carr f0 alice l8 n1 n0)
   deleted: (carrying carr f0) (crates_amount carr n1)
   added: (has_crate alice f0) (crates_amount carr n0)
   goals met: 6 of 8
13. (back_to_warehouse agent carr l8 depot)
   deleted: (robot_at agent l8) (carrier_at carr l8)
   added: (robot_at agent depot) (carrier_at carr depot)
   goals met: 6 of 8
14. (load agent carr m4 depot n0 n1)
   deleted: (crate_at m4 depot) (crates_amount carr n0)
   added: (carrying carr m4) (crates_amount carr n1)
   goals met: 6 of 8
15. (load agent carr m5 depot n1 n2)
   deleted: (crate_at m5 depot) (crates_amount carr n1)
   added: (carrying carr m5) (crates_amount carr n2)
   goals met: 6 of 8
16. (move_for_delivery agent carr depot l7)
   deleted: (robot_at agent depot) (carrier_at carr depot)
   added: (robot_at agent l7) (carrier_at carr l7)
   goals met: 6 of 8
17. (unload agent carr m4 federico l7 n2 n1)
   deleted: (carrying carr m4) (crates_amount carr n2)
   added: (has_crate federico m4) (crates_amount carr n1)
   goals met: 7 of 8
18. (move_for_delivery agent carr l7 l8)
   deleted: (robot_at agent l7) (carrier_at carr l7)
   added: (robot_at agent l8) (carrier_at carr l8)
   goals met: 7 of 8
19. (unload agent carr m5 alice l8 n1 n0)
   deleted: (carrying carr m5) (crates_amount carr n1)
   added: (has_crate alice m5) (crates_amount carr n0)
   goals met: 8 of 8
